# BuildingHVACSystem Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
EnergyDataSettings..::..BuildingHVACSystem Property
EnergyDataSettings Class See Also
---
The type of HVAC system used by the building for conceptual model energy calculations.
**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2011
# Syntax
C#
---
```text
public gbXMLBuildingHVACSystem BuildingHVACSystem { get; set; }
```

Visual Basic
---
```text
Public Property BuildingHVACSystem As gbXMLBuildingHVACSystem
	Get
	Set
```

Visual C++
---
```text
public:
property gbXMLBuildingHVACSystem BuildingHVACSystem {
	gbXMLBuildingHVACSystem get ();
	void set (gbXMLBuildingHVACSystem value);
}
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentException | When setting this property: The building HVAC system does not fall within an appropriate range. |
| Autodesk.Revit.Exceptions..::..ArgumentOutOfRangeException | When setting this property: A value passed for an enumeration argument is not a member of that enumeration |

# See Also
EnergyDataSettings Class
Autodesk.Revit.DB.Analysis Namespace